# Commande de base Switch Cisco

## ğŸ”§ 1. AccÃ©der au mode privilÃ©giÃ©

```
Switch> enable
```

> Passe en mode privilÃ©giÃ© (niveau supÃ©rieur de commande).

## âš™ï¸ 2. Entrer en mode de configuration globale

```
Switch# configure terminal
```

## ğŸ•µï¸ 3. DÃ©finir le nom du switch

```
Switch(config)# hostname NomSwitch
```

## ğŸ”’ 4. Configurer un mot de passe pour le mode privilÃ©giÃ©

```
NomSwitch(config)# enable password votre_mot_de_passe
```

ğŸ‘‰ Ou (plus sÃ©curisÃ©) :

```
NomSwitch(config)# enable secret votre_mot_de_passe
```

## ğŸ” 5. SÃ©curiser lâ€™accÃ¨s en console

```
NomSwitch(config)# line console 0
NomSwitch(config-line)# password votre_mot_de_passe
NomSwitch(config-line)# login
NomSwitch(config-line)# exit
```

##  ğŸ“¡ 6. Configurer les lignes VTY (accÃ¨s distant : Telnet/SSH)

```
NomSwitch(config)# line vty 0 15
NomSwitch(config-line)# password votre_mot_de_passe
NomSwitch(config-line)# login
NomSwitch(config-line)# transport input telnet ssh
NomSwitch(config-line)# exit
```

## ğŸ”§ 7. Configurer une interface VLAN pour lâ€™administration (ex: VLAN 1)

```
NomSwitch(config)# interface vlan 1
NomSwitch(config-if)# ip address 192.168.1.2 255.255.255.0
NomSwitch(config-if)# no shutdown
NomSwitch(config-if)# exit
```

## ğŸ”§ 7Bis. Configurer d'un Vlan


CrÃ©ation d'un VLAN
```
vlan "numÃ©ro_vlan"
```
Affesctation d'un VLAN Ã  un groupe d'interfaces
```
interface range Fa0/"min - max"
    switchport mode access
    switchport access vlan "numÃ©ro_vlan"
```
Configuration d'un port en agrÃ©gation de VLAN 802.1Q
```
interface "nom_interface"
    switchport mode trunk
```

Pour vÃ©rifier les interfaces VLAN 

```
! Affiche la liste des VLAN
show vlan
! Affiche les agrÃ©gations de VLAN
show interface trunk
```

## ğŸŒ 8. DÃ©finir la passerelle par dÃ©faut

```
NomSwitch(config)# ip default-gateway 192.168.1.1
```

## ğŸ‘¥ 9. CrÃ©er un compte utilisateur (recommandÃ© pour SSH)

```
NomSwitch(config)# username admin password votre_mot_de_passe
```

## ğŸ” 10. Activer et configurer SSH (optionnel mais recommandÃ©)

```
NomSwitch(config)# ip domain-name monreseau.local
NomSwitch(config)# crypto key generate rsa
# Choisir une taille de clÃ© (ex: 1024 ou 2048)

NomSwitch(config)# line vty 0 15
NomSwitch(config-line)# login local
NomSwitch(config-line)# transport input ssh
NomSwitch(config-line)# exit
```

## ğŸ’¾ 11. Sauvegarder la configuration

```
NomSwitch# write memory
# ou
NomSwitch# copy running-config startup-config
```

## âœ… 12. VÃ©rification (commandes utiles)

- Voir la configuration en cours :

```
NomSwitch# show running-config
```

- VÃ©rifier les interfaces :

```
NomSwitch# show ip interface brief
```

- Voir les VLANs :

```
NomSwitch# show vlan brief
```